{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"output_shape": [66, 200, 3], "trainable": true, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [2, 2], "bias": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "name": "convolution2d_1", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_col": 5, "nb_filter": 24, "init": "he_normal", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [2, 2], "bias": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_col": 5, "nb_filter": 36, "init": "he_normal", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [2, 2], "bias": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 5, "trainable": true, "name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_col": 5, "nb_filter": 48, "init": "he_normal", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_4", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "nb_filter": 64, "init": "he_normal", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "bias": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "trainable": true, "name": "convolution2d_5", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "nb_col": 3, "nb_filter": 64, "init": "he_normal", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_1", "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"output_dim": 50, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_2", "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"output_dim": 10, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_3", "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "bias": true, "activity_regularizer": null, "name": "dense_4", "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "input_dim": null, "init": "he_normal", "activation": "linear", "b_constraint": null}}]}