{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [66, 200, 3], "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 24, "W_regularizer": null, "init": "he_normal", "bias": true, "subsample": [2, 2], "activation": "linear", "nb_row": 5, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 36, "W_regularizer": null, "init": "he_normal", "bias": true, "subsample": [2, 2], "activation": "linear", "nb_row": 5, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 48, "W_regularizer": null, "init": "he_normal", "bias": true, "subsample": [2, 2], "activation": "linear", "nb_row": 5, "b_constraint": null, "nb_col": 5, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 64, "W_regularizer": null, "init": "he_normal", "bias": true, "subsample": [1, 1], "activation": "linear", "nb_row": 3, "b_constraint": null, "nb_col": 3, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 64, "W_regularizer": null, "init": "he_normal", "bias": true, "subsample": [1, 1], "activation": "linear", "nb_row": 3, "b_constraint": null, "nb_col": 3, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": null, "W_constraint": null, "b_constraint": null, "output_dim": 512, "name": "dense_1", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": null, "W_constraint": null, "b_constraint": null, "output_dim": 100, "name": "dense_2", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": null, "W_constraint": null, "b_constraint": null, "output_dim": 50, "name": "dense_3", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.3}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": null, "W_constraint": null, "b_constraint": null, "output_dim": 10, "name": "dense_4", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dim": null, "W_constraint": null, "b_constraint": null, "output_dim": 1, "name": "dense_5", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null}}]}