{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"output_shape": [66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "trainable": true, "name": "lambda_1", "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "he_normal", "trainable": true, "bias": true, "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "nb_filter": 24, "name": "convolution2d_1", "dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "he_normal", "trainable": true, "bias": true, "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "nb_filter": 36, "name": "convolution2d_2", "dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "he_normal", "trainable": true, "bias": true, "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "nb_filter": 48, "name": "convolution2d_3", "dim_ordering": "tf", "b_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "nb_row": 5, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "he_normal", "trainable": true, "bias": true, "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "nb_filter": 64, "name": "convolution2d_4", "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "he_normal", "trainable": true, "bias": true, "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "activation": "linear", "nb_filter": 64, "name": "convolution2d_5", "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "nb_row": 3, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "he_normal", "bias": true, "activity_regularizer": null, "output_dim": 100, "b_constraint": null, "input_dim": null, "activation": "linear", "trainable": true, "name": "dense_1", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "he_normal", "bias": true, "activity_regularizer": null, "output_dim": 50, "b_constraint": null, "input_dim": null, "activation": "linear", "trainable": true, "name": "dense_2", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "he_normal", "bias": true, "activity_regularizer": null, "output_dim": 10, "b_constraint": null, "input_dim": null, "activation": "linear", "trainable": true, "name": "dense_3", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"W_constraint": null, "init": "he_normal", "bias": true, "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "input_dim": null, "activation": "linear", "trainable": true, "name": "dense_4", "b_regularizer": null, "W_regularizer": null}}]}