{"keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape": [66, 200, 3], "input_dtype": "float32", "arguments": {}, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "subsample": [2, 2], "trainable": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 24, "activation": "linear", "init": "he_normal", "nb_row": 5, "border_mode": "valid", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "subsample": [2, 2], "trainable": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 36, "activation": "linear", "init": "he_normal", "nb_row": 5, "border_mode": "valid", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "subsample": [2, 2], "trainable": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 48, "activation": "linear", "init": "he_normal", "nb_row": 5, "border_mode": "valid", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "subsample": [1, 1], "trainable": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "activation": "linear", "init": "he_normal", "nb_row": 3, "border_mode": "valid", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "subsample": [1, 1], "trainable": true, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "activation": "linear", "init": "he_normal", "nb_row": 3, "border_mode": "valid", "bias": true, "b_constraint": null, "b_regularizer": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_1", "W_regularizer": null, "b_constraint": null, "output_dim": 512, "bias": true, "b_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_2", "W_regularizer": null, "b_constraint": null, "output_dim": 100, "bias": true, "b_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_3", "W_regularizer": null, "b_constraint": null, "output_dim": 50, "bias": true, "b_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.3}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_4", "W_regularizer": null, "b_constraint": null, "output_dim": 10, "bias": true, "b_regularizer": null, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "name": "dense_5", "W_regularizer": null, "b_constraint": null, "output_dim": 1, "bias": true, "b_regularizer": null, "trainable": true}}], "class_name": "Sequential"}