{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "trainable": true, "arguments": {}, "output_shape": [66, 200, 3], "function_type": "lambda", "name": "lambda_1", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "bias": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_1", "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 24, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "bias": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_2", "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 36, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "bias": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "nb_col": 5, "name": "convolution2d_3", "subsample": [2, 2], "border_mode": "valid", "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 48, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "bias": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "name": "convolution2d_4", "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "he_normal", "bias": true, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "nb_col": 3, "name": "convolution2d_5", "subsample": [1, 1], "border_mode": "valid", "activation": "linear", "trainable": true, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_1", "output_dim": 1164, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_2", "output_dim": 100, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_3", "output_dim": 50, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_4", "output_dim": 10, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dense", "config": {"init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_5", "output_dim": 1, "activation": "linear", "trainable": true, "b_constraint": null, "W_regularizer": null}}]}