{"config": [{"config": {"trainable": true, "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape": [66, 200, 3]}, "class_name": "Lambda"}, {"config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_1", "bias": true, "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "nb_filter": 24, "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "he_normal", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_2", "bias": true, "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "nb_filter": 36, "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "he_normal", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_3", "bias": true, "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "nb_filter": 48, "W_constraint": null, "nb_col": 5, "dim_ordering": "tf", "init": "he_normal", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_4", "bias": true, "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "init": "he_normal", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_5", "bias": true, "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "init": "he_normal", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_regularizer": null, "name": "dense_1", "bias": true, "input_dim": null, "W_regularizer": null, "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"trainable": true, "b_regularizer": null, "name": "dense_2", "bias": true, "input_dim": null, "W_regularizer": null, "output_dim": 50, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "name": "dense_3", "bias": true, "input_dim": null, "W_regularizer": null, "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "name": "dense_4", "bias": true, "input_dim": null, "W_regularizer": null, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}