{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "trainable": true, "output_shape": [66, 200, 3], "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "he_normal", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "bias": true, "activation": "linear", "b_regularizer": null, "border_mode": "valid", "nb_filter": 24, "name": "convolution2d_1", "trainable": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "he_normal", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "bias": true, "activation": "linear", "b_regularizer": null, "border_mode": "valid", "nb_filter": 36, "name": "convolution2d_2", "trainable": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "he_normal", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "bias": true, "activation": "linear", "b_regularizer": null, "border_mode": "valid", "nb_filter": 48, "name": "convolution2d_3", "trainable": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "he_normal", "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "bias": true, "activation": "linear", "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "name": "convolution2d_4", "trainable": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "he_normal", "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "bias": true, "activation": "linear", "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "name": "convolution2d_5", "trainable": true, "W_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "b_constraint": null, "trainable": true, "output_dim": 100, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "he_normal", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "b_constraint": null, "trainable": true, "output_dim": 50, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "he_normal", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_3", "b_constraint": null, "trainable": true, "output_dim": 10, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "he_normal", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_4", "b_constraint": null, "trainable": true, "output_dim": 1, "W_constraint": null, "bias": true, "activity_regularizer": null, "b_regularizer": null, "input_dim": null, "init": "he_normal", "W_regularizer": null}}], "keras_version": "1.1.2"}