{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "name": "lambda_1", "input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "batch_input_shape": [null, 66, 200, 3], "output_shape": [66, 200, 3], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "init": "he_normal", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_1", "activation": "linear", "b_regularizer": null, "W_constraint": null, "nb_filter": 24, "b_constraint": null, "nb_row": 5, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "init": "he_normal", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_2", "activation": "linear", "b_regularizer": null, "W_constraint": null, "nb_filter": 36, "b_constraint": null, "nb_row": 5, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "init": "he_normal", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_3", "activation": "linear", "b_regularizer": null, "W_constraint": null, "nb_filter": 48, "b_constraint": null, "nb_row": 5, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "nb_col": 3, "bias": true, "name": "convolution2d_4", "activation": "linear", "b_regularizer": null, "W_constraint": null, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "nb_col": 3, "bias": true, "name": "convolution2d_5", "activation": "linear", "b_regularizer": null, "W_constraint": null, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "init": "he_normal", "W_regularizer": null, "bias": true, "name": "dense_1", "activation": "linear", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "output_dim": 100, "input_dim": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "init": "he_normal", "W_regularizer": null, "bias": true, "name": "dense_2", "activation": "linear", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "output_dim": 50, "input_dim": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "init": "he_normal", "W_regularizer": null, "bias": true, "name": "dense_3", "activation": "linear", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "output_dim": 10, "input_dim": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "init": "he_normal", "W_regularizer": null, "bias": true, "name": "dense_4", "activation": "linear", "b_regularizer": null, "W_constraint": null, "b_constraint": null, "output_dim": 1, "input_dim": null, "activity_regularizer": null}}]}